Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: tm/Ibrahim_Compliance-level1.tmx
Source language: en_us
Languages: ja

source: That situation is changing, however, thanks to the efforts of the Linux Foundation’s FOSSBazaar Software Package Data Exchange (SPDX(TM)) Working Group.
ja: しかし状況は変化しています。The Linux Foundation の FOSSBazaar Software Package Data Exchange (SPDX(TM)) ワーキング グループがこの活動に取り組みました。

source: The component is registered in the software inventory marking the component name, version, internal owner and the details of the product where it’s being used such as product name, version, release number, etc.
ja: 対象のコンポーネントがソフトウェア インベントリに登録され、コンポーネント名、バージョン、社内所有者、およびコンポーネントを使用する製品の詳細情報 (製品名、バージョン、リリース番号など) が記録される。

source: Incremental Build Processing ?
ja: インクリメンタル ビルド処理

source: Proposed Solutions
ja: 解決案

source: Many approaches to ensuring license compliance exist - from handcrafted spreadsheets to free software options like FOSSology, to enterprise-class applications such as the Black Duck Suite - yet an overarching standard for software package data exchange(TM) has been elusive.
ja: 手作りのスプレッドシートから、FOSSology のようなフリー ソフトウェア オプション、あるいは Black Duck Suite のようなエンタープライズクラスのアプリケーションまで、ライセンス コンプライアンスを確実に履行するためのアプローチは数多くありますが、ソフトウェア パッケージ データ交換の包括的な標準規格は見当たりません。

source: Phil Odence is Vice President of Business Development for Black Duck Software, makers of enterprise app development tools that address management, compliance and security challenges associated with open source.
ja: Phil Odence は、Black Duck Software のビジネス開発担当バイス プレジデントです。同社は、オープン ソースに関わる管理、コンプライアンス、およびセキュリティ問題を処理する企業アプリケーション開発ツールを提供しています。

source: The checklist will be formally launched in q4 of 2010.
ja: このチェックリストは、2010 年中に正式に公開される予定です。

source: Companies often provide such education through formal and informal training sessions.
ja: 企業は通常、公式および非公式なトレーニング セッションを開催し、このような教育を行っています。

source: Overview of compliance
ja: コンプライアンスの概要

source: Different companies have used various ways to structure their teams responsible for fulfilling this function.
ja: 企業はそれぞれのやり方で、ライセンスの順守に責任を負うチームを構成しています。

source: - It improves the relationship with the FOSS community because the community knows the organization has a plan to comply with FOSS licenses
ja: 組織が FOSS ライセンスを順守しようとしていることが FOSS コミュニティに伝わり、FOSS コミュニティとの関係が良好になる

source: Performing a post-distribution verifications
ja: 配布後の検証を行う

source: Senior management responsible for profit & loss and compliance in the corporation, including
ja: 企業の損益やコンプライアンスの責任を負う、以下のような管理者層

source: For example, there is no report showing potentially conflicting licenses in a file or project.
ja: たとえば、ファイルやプロジェクトにライセンス違反の可能性があることを報告しない。

source: This failure occurs when the OSRB fail to finalize the audit results of any specific component, produce an audit report and attach it to the compliance ticket for that specific component.
ja: この違反は、OSRB が指定のコンポーネントの監査結果をまとめ、監査レポートを作成し、かつそのレポートをそのコンポーネントのコンプライアンス チケットに添付する、という一連の作業を完了していないときに発生する。

source: a) The organization systematically tracks open issues.
ja: a) 組織は、未解決の問題を体系的に追跡する。

source: Introduction
ja: はじめに

source: Approvals are dependent on usage models and for instance, a GPL software component that is approved for inclusion in Product A may not be approved for inclusion in Product B based on a different usage model.
ja: 承認は、製品ごとに必要です。たとえば、A 製品への使用が承認された GPL ソフトウェア コンポーネントでも、B 製品への使用を承認されないこともあります。

source: The source server is the interface point of the backend for the frontend through its HTTP interface.
ja: ソース サーバーは、HTTP インタフェースを介して、フロントエンドへのバックエンドのインタフェース ポイントとなります。

source: About the Linux Foundation
ja: The Linux Foundation について

source: This includes establishing and maintaining consistent compliance policies and procedures, and ensuring that the licenses of all the software components in use (proprietary, 3rd party and FOSS) can co-existence well before shipment.
ja: たとえば、一貫性のあるコンプライアンス ポリシーや手続きを確立および維持すること、使用しているすべて (プロプライエタリ、サード パーティ、および FOSS) のソフトウェア コンポーネントのライセンスがうまく共存していることを出荷前に確認すること、などです。

source: The goal of the tool is to flag problematic code combinations at the dynamic and static link level.
ja: このツールの目的は、動的および静的リンク レベルで、問題発生の可能性のあるコードの組み合わせを警告することです。

source: Source code distribution mechanisms
ja: ソース コード配布メカニズム

source: The OSRB responsibilities include the following:
ja: OSRB の責任

source: Since OBS's atomic entity for managing sources is the Package which contains the individual files the source repository server is not a replacement for typical source control systems such as GIT, CVS, SVN, and so on which track changes on an individual file level.
ja: OBS のソース管理用の基本要素は、個々のファイルを含むパッケージなので、このソース リポジトリ サーバーは、個々のファイル レベルで変更を追跡する GIT、CVS、SVN などのようなソース制御システムの代わりになるものではありません。

source: Adequate Compliance Staffing focuses on the skilled resources needed to implement the compliance program.
ja: 「コンプライアンス要員の適正配置」プロセスは、コンプライアンス プログラムの履行に必要なスキルを持つ人材を集めることに焦点を当てます。

source: Compliance Tools:
ja: コンプライアンス ツール:

source: Identify any source code modifications to FOSS .
ja: FOSS に対するソース コードの改変をすべて特定します。

source: Where does it go from here?
ja: 今後の予定

source: OBS is integrated with the openSUSE KIWI Image System which provides a complete operating system image solution for hardware platforms supported by Linux as well as for virtualization systems like Xen, Qemu or VMWare.
ja: OBS は、openSUSE KIWI イメージ システムと統合されています。openSUSE KIWI イメージ システムは、Linux がサポートするハードウェア プラットフォームにも、Xen、Qemu、VMWare などの仮想システムにも対応できる完全なオペレーティング システム イメージ ソリューションを提供します。

source: Auditing Phase
ja: 監査フェーズ

source: Managing thecomplianceprogram
ja: コンプライアンス プログラムの管理

source: Engineering teams should continuously conduct design reviews to discover and remedy any compliance issues in a timely manner.
ja: エンジニアリング チームは、継続的に設計レビューを実施し、あらゆるコンプライアンス問題を迅速に検出および修正します。

source: Improving your overall FOSS strategy using the results from your compliance program
ja: コンプライアンス プログラムの結果を利用して FOSS 戦略全体を向上させる

source: To support this, the MeeGo OBS environment builds bootable MeeGo images for the various MeeGo device categories and user experiences (Handset, Netbook, Tablet PC, In-vehicle Infotainment, and Smart TV) targeting multiple different hardware platforms for IA, ARM, etc.
ja: これをサポートするために、MeeGo OBS 環境は、IA や ARM をはじめとするさまざまなハードウェア プラットフォームを対象に、各種 MeeGo デバイスとユーザー エクスペリエンス (ハンドセット、ネットブック、タブレット PC、車載インフォテインメント、およびスマート テレビ) に対応したブート可能な MeeGo イメージをビルドします。

source: Professional and Comprehensive Compliance Training:
ja: 専門的/包括的コンプライアンストレーニング:

source: b) Supplier disclosures are used in cases where source code is not available.
ja: b) ソース コードを利用できない場合には、サプライヤーの開示を使用する。

source: Additional Readings and Resources
ja: その他の資料

source: MeeGo Weekly Release Cycle
ja: MeeGo ウィークリー リリースのサイクル

source: - Contribute to creation of the FOSS training
ja: FOSS トレーニング開発に貢献する

source: Notices Phase
ja: 告知フェーズ

source: b)A process FMEA (failure mode effects analysis) is performed to identify ways that compliance failures could occur and the business processes that should be modified to prevent such failures.
ja: b) プロセス失敗モード影響解析 (failure modes effects analysis: FMEA) を実行し、コンプライアンスの失敗の発生パターンや、そのような失敗を防ぐために変更するべきビジネス プロセスを特定する。

source: Inform the inquirer about your compliance program and practices and assure them that you will investigate their concern.
ja: 自社のコンプライアンスの体制および活動を照会者に伝え、彼らの懸念事項を調査する旨を確約します。

source: The Binary Analysis Tool, available at http://www.binaryanalysis.org, can help to discover what components were used to create compiled code.
ja: http://www.binaryanalysis.org から入手できるバイナリ解析 (Binary Analysis) ツールを使用すると、コンパイル済みのコードから、使用されているコンポーネントを導き出すことができます。

source: In the following sections, we will discuss the challenges companies face when establishing compliance program and offer recommendations on how can to overcome these challenges via an operational focused approach.
ja: ここでは、企業がコンプライアンス プログラムを構築する際に直面する課題について説明し、運用面からこれらの課題を克服するためのアドバイスを提案します。

source: The Linux Foundation can assist, where appropriate, in establishing contact with company compliance officers.
ja: また LF は、必要に応じて、企業のコンプライアンス オフィサーと連絡をとります。

source: The establishment of a Trust Model as described above would solve the problem of secure boot from these media (since Open OS vendors would simply sign the media with a key traceable to the root of trust).
ja: もしも前述のような信頼モデルが確立されれば、こうしたメディアからの secure boot の問題は解決します。なぜなら、オープン OS ベンダーが、信頼の起点に到達できる鍵を使用して、メディアに署名しているからです。

source: Linkage analysis tool
ja: リンク解析ツール (Linkage analysis tool)

source: a) At an agreed-upon frequency, the organization conducts an audit/inventory of OSS used internally and records its findings.
ja: a) 組織は、合意された頻度で、社内で使用されている OSS の監査と目録作成を実施し、その結果を記録する。

source: But the core elements of compliance usually remain the same: identifying the open source in the code base; reviewing and approving its use; and satisfying obligations.
ja: しかしコンプライアンスの中心的要素は、ほとんど同じです。つまりコード ベース内のオープン ソースの識別、その使用についての調査と承認、および義務の履行です。

source: As with the Software Engineering Institute's appraisal program, checklist users should distinguish between a practice that exists as a paper definition from one that is routinely used and relied upon to achieve compliance.
ja: Software Engineering Institute (SEI) の評価プログラムもそうですが、チェックリストの利用者は、書類上の定義としてのプラクティスと、コンプライアンスを履行するために日常的に使用し、依拠しているプラクティスとを区別する必要があります。◆◆

source: The Linux Foundation is a nonprofit consortium dedicated to fostering the growth of Linux.
ja: The Linux Foundation は、Linux の成長促進に取り組む非営利のコンソーシアムです。

source: The Open Compliance Program Self-Assessment Checklist 1
ja: オープン コンプライアンス プログラム 自己診断チェックリスト

source: At some future time, an operating-system- and vendor-neutral certificate authority should be established to issue KEKs for third-party hardware and software vendors.
ja: OS 中立かつベンダー中立な認証局が将来的に設置され、サードパーティのハードウェア/ソフトウェア ベンダー向けの鍵交換鍵を発行する。

source: Applications
ja: アプリケーション

source: As an example, we will upload the MythTV source code package to the server by specifying its download URL and select license detection (Figure 2).
ja: たとえば、ダウンロード URL を指定して、MythTV ソース コード パッケージをサーバーにアップロードし、ライセンス検出を選択します (図 2)。

source: - OSRB (Open Source Review Board) which includes the OSRB chair (Compliance Officer), the Legal counsel and the OSRB engineering representative
ja: OSRB (オープン ソース調査委員会)。メンバーは、OSRB チェア (コンプライアンス オフィサー)、法律顧問 (リーガル カウンセラー)、OSRB エンジニアリング部門代表者など。

source: There is no central repository of FOSSology scans.
ja: FOSSology スキャンの中央リポジトリが存在しない。

source: There are potentially thousands of contributors to the various FOSS projects used
ja: 使用している FOSS プロジェクトに対して、数千人のコントリビューターが存在する場合もある

source: Proprietary, developed by the company building the product or by one of its acquired subsidiaries
ja: プロプライエタリ: その製品の製造元またはその子会社が開発したコード

source: Compliance Officer1
ja: コンプライアンス オフィサー 1

source: b)The organization systematically tracks closure of OSS issues identified during the discovery process.
ja: b) 組織は、検出プロセスで確認された OSS 問題の解決を体系的に追跡する。

source: You will find Debian packages, yum repositories, as well as how to install from source.
ja: Debian パッケージ、yum リポジトリ、およびソースからのインストール方法が提供されています。

source: Home page of FOSSology after installation on your local server (administrator menu shown)
ja: ローカル サーバーにインストールした後の FOSSology のホーム ページ (管理者メニューが表示されている)

source: Collect of attribution an license notices as FOSS is approved for inclusion in the product.
ja: FOSS を製品に組み込むことが承認されたら、帰属告知とライセンス告知を収集します。

source: - Inform the end user of their product how to obtain a copy of the FOSS source code (when applicable)
ja: 製品のエンド ユーザーに、対応する FOSS ソース コードのコピーの入手方法を通知します (必要に応じて)

source: FOSSology is available from: http://www.fossology.org/
ja: FOSSology は、次のページから入手できます。 http://www.fossology.org/

source: Multi-platform Support
ja: マルチプラットフォーム サポート

source: The sample end-to-end compliance process (Figure 3) involves the following:
ja: コンプライアンス プロセスの詳細例 (図 3) には、以下の処理が含まれています。

source: The organization engages in user group meetings and community forums related to compliance tools.
ja: 組織は、コンプライアンス ツールに関連のあるユーザー グループ会議やコミュニティ フォーラムに参加していること。

source: An inquiry response strategy establishes what must be done when the company receives a compliance inquiry or when the company's compliance efforts are being challenged.
ja: 照会対応戦略は、企業がコンプライアンス違反に関する照会を受けたときや、コンプライアンスへの取り組みに疑義が生じたときに何を行うべきかを規定しています。

source: - The Software Package Data Exchange™ : The SPDX™ specification is a standard format for communicating the components, licenses and copyrights associated with a software package.
ja: ソフトウェア パッケージ データ交換 (Software Package Data Exchange™): SPDX™ 仕様とは、 ソフトウェア パッケージに関連するコンポーネント、ライセンス、および著作権情報をやりとりするための 標準フォーマットです。

source: Update documentation to inform users how to obtain a copy of the FOSS
ja: ドキュメントを更新し、ユーザーに FOSS のコピーの入手方法を通知する

source: a)Teams provide, as required by specific licenses, the complete source code, which may include any associated interface definition files, plus the scripts used to control compilation and installation of the executable.
ja: a) チームは、ライセンス条件に定められている場合は、完全なソース コードを提供する。これには、関連するすべてのインタフェース定義ファイル、およびコンパイルと実行ファイルのインストールを制御するために使用されるスクリプトなども含まれる場合がある。

source: Ideally, this tool would be activated by the UEFI system as soon as it saw unauthorised media inserted, so the platform owner could decide whether they wished to accept the key for OS install and boot.
ja: 未承認のメディアが挿入された後、すぐにこのツールが UEFI システムによってアクティベートされれば、プラットフォーム オーナーが、OS のインストールとブート用の鍵を承認するかどうかを決定できます。

source: Furthermore, not every reporter understands licenses fully and sometimes there may be mistakes in their submissions.
ja: すべての照会者がライセンスについて十分理解しているとは限らないため、その内容に誤りがある場合もあります。

source: Benefits
ja: 機能

source: These tools include:
ja: たとえば、以下のようなツールがあります。

source: The six elements of the Linux Foundation’s Open Compliance Program are:
ja: The Linux Foundation のオープン コンプライアンス プログラムには、次の 6 つの要素があります。

source: If you are looking for a general introduction into OBS, its capabilities, features and components then [1] will be the right start.
ja: OBS の概論、機能、およびコンポーネントについて知りたい方は、[1] をお読みください。

source: Subscribe to the mailing list: https://lists.linux-foundation.org/mailman/listinfo/code-janitor-dev
ja: メーリング リストに登録: https://lists.linux-foundation.org/mailman/listinfo/code-janitor-dev

source: The initial ignition of an Operating System that makes use of secure boot (whether that system is pre-installed or installed from external media) should detect that the platform is in setup mode; the operating system can then switch the platform to the secure mode by installing a platform key after it has installed the KEK corresponding to the its own code.
ja: secure boot を利用する OS は、まず、(システムがプリインストールされたものでも、外部メディアからインストールされたものでも) そのプラットフォームが setup モードであることを検知します。OS はその後、各 OS 固有のコードに対応した鍵交換鍵をインストールし、さらにプラットフォーム鍵をインストールすることで、プラットフォームを secure モードに切り替えることができます。

source: Image Step
ja: イメージ ステップ

source: The OSRB deploys and uses several tools to automate and facilitate the auditing of source code and the discovery of source code and licenses.
ja: OSRB はツールを導入および使用し、ソース コードの監査処理や、ソース コードとライセンスの検出処理を自動化および促進します。

source: In parallel, engineering and product teams have several responsibilities with respect to FOSS compliance:
ja: 同時に、エンジニアリング/プロダクト チームは、FOSS コンプライアンスに関して次のような責任を負います。

source: a)The compliance team verifies that any offers of source code have been included as required.
ja: a) コンプライアンス チームは、ソース コードとして必要なすべての提供物が含まれていることを検証すること。

source: FOSSology analyzes a given set of software packages, and reports items such as the software licenses used by these packages.
ja: FOSSology は指定されたソフトウェア パッケージ群を分析し、その中で使用されているソフトウェア ライセンスなどを検出します。

source: Individuals or teams responsible for documentation and localization activities perform necessary tasks to assure that obligations are met.
ja: ドキュメンテーションやローカリゼーションの担当者、あるいはチームは、確実に義務を履行するために必要な作業を行うこと。

source: This paper picks up from where the first paper left off and provides a discussion on the following topics:
ja: このペーパーでは、第一弾で触れなかったものの中から、以下のテーマを選んで解説します。

source: The compliance team verifies that open source can be obtained via the defined distribution mechanism and that the source code thus obtained can be built in an independent environment.
ja: コンプライアンス チームは、オープン ソースを定義された配布メカニズムで取得できること、および、取得したそのソース コードを独立した環境でビルドできることを検証すること。

source: In such a dynamic environment, the compliance program must evolve as well.
ja: そのような動的な環境では、コンプライアンス プログラムも進化を続ける必要があります。

source: The checklist may also be used by organizations, especially during the supplier selection process, to assess a supplier's compliance process and gauge the likely reliability of its open source disclosures.
ja: また、このチェックリストは、組織がサプライヤーを選定する際に、サプライヤーのコンプライアンス プロセスを評価したり、サプライヤーのオープン ソース開示の信頼性などを判断したりする際にも使用できます。

source: a)The organization defines a code distribution mechanism that satisfies the requirements of particular OSS licenses.
ja: a) 組織は、特定の OSS ライセンスの要件を満たすコード配布メカニズムを定義する。

source: - Knowledge of FOSS community consensus and practices
ja: FOSS コミュニティの合意および慣行に関する知識

source: - An audit report identifying the origins and licenses of the source code.
ja: ソース コードの出自とライセンスを特定する監査報告

source: Notes:
ja: メモ:

source: Include compliance goals in the employees performance review.
ja: 従業員の勤務評価にコンプライアンスの目標を含める。

source: Companies at all points in the supply chain are becoming conscious of the need to treat open source just like any other third party code.
ja: サプライ チェーンのどの位置にある企業も、サード パーティ コードと同じようにオープン ソースを扱う必要性を自覚しつつあります。

source: Furthermore, the FOSS license interpretations and legal risks continue to evolve.
ja: また、FOSS のライセンスの解釈や法務リスクは常に進化しています。

source: Copyright dates (if listed)
ja: 著作権発生日 (掲載があれば)

source: The name and version of the software component in question
ja: 対象となるソフトウェア コンポーネントの名前およびバージョン

source: - Historical perspective on FOSS
ja: FOSS に関する歴史観

source: Companies achieve initial compliance through the collection of the following activities:
ja: 企業は、以下の活動により、最初のコンプライアンスを遂行します。

source: The organization devises a systematic approach to identifying changes in the code baseline and performing incremental compliance on changes in an efficient manner.
ja: 組織は、コード ベースラインの変更を識別でき、かつ変更に伴ってさらに必要となるコンプライアンスを効率的に履行するための体系的な方法を考案する。◆

source: Ways to Get Started in Embedded Linux Development
ja: 組込み Linux 開発を始めるための 10 の方法

source: For any given software components, the reviewers of the compliance ticket are:
ja: ソフトウェア コンポーネントのコンプライアンス チケットは、以下のような担当者が調査します。

source: Preface
ja: 序文

source: - Decide on FOSS strategy
ja: FOSS 戦略の決定

source: In addition, the analyzed file will be added to the file repository and the results of the analysis will be written to the database and made available to other users of the tool.
ja: また、解析されたファイルはファイル リポジトリに追加され、解析結果はデータベースに書き込まれるため、他のユーザーも参照できます。

source: Planning a software organization with a build system as part of the process from the beginning is simplified by a build system such as OBS which easily scales over time.
ja: ソフトウェア組織のプロセスの一部に最初からビルド システムを組み込むことは、簡単に持続的にスケール可能な OBS のようなビルド システムによって、シンプルになっています。

source: Each of the three steps compile, package and image requires three "ingredients" that must be provided by the developer.
ja: コンパイル、パッケージ、イメージの各ステップには、開発者によって提供されるべき 3 つの「成分」が必要です。

source: Topics address what needs to be done and how to integrate compliance activities with existing development and business processes.
ja: テーマは、「何を行うべきか」および「既存の開発プロセスやビジネス プロセスとコンプライアンス活動をどう統合するか」です。

source: Publishing
ja: パブリッシュ◆

source: Approval Phase
ja: 承認フェーズ

source: Furthermore, agreements relating to outsourced development of software should also be updated to reflect compliance procedures and to ensure that other provisions of these agreements.
ja: また、外注のソフトウェア開発に関する契約書も、コンプライアンスの手続きを反映するように更新し、これらの契約書のその他の条項についても確認します。

source: In this paper, we covered some of the recommended practices related to the various steps in a sample FOSS compliance end-to-end process.
ja: このホワイトペーパーでは、FOSS コンプライアンス管理プロセスの各ステップで利用するべきプラクティスいついて説明しました。

source: The repository server serves binary packages to the workers and the frontend API.
ja: リポジトリ サーバーは、ワーカーとフロントエンド API にバイナリ パッケージを提供します。

source: OBS includes a build service that can scale from a single instance running on the same physical system together with all other OBS components to a distributed build farm with many instances distributed across multiple physical systems that do not necessarily have to be co-located.
ja: OBS に含まれるビルド サービスは、他のすべての OBS コンポーネントと同じ物理システムで動作するシングル インスタンスにも、複数の (必ずしも同じ場所に存在する必要はない) 物理システムに多数のインスタンスが分散されている分散ビルド ファームにも対応可能です。

source: Other than the responsibilities defined as part of its OSRB role, the Legal representative carries the following responsibilities:
ja: OSRB の役割として定義されてはいませんが、法律顧問は下記のような責任を負います。

source: Code re-use may have introduced code fragments and components covered by a range of incompatible licenses.
ja: コードを再利用すると、両立性のない各種のライセンスでカバーされたコードの断片やコンポーネントが取り込まれることがある。

source: As software evolves over time, new code components may be included that have different licenses, conceivably at any level of the software.
ja: ソフトウェアが時間とともに進化するにつれ、異なるライセンスを持つ複数の新しいコード コンポーネントが、ともすればあらゆるソフトウェア レベルで組み込まれる可能性があります。

source: - Auditing the full platform or product code to establish a compliance baseline, then auditing code modules that are changed in subsequent releases.
ja: プラットフォームや製品のすべてのコードを監査してコンプライアンスのベースラインを確立した後、後続リリースで変更されているコード モジュールを監査する。

source: POLICIES AND PROCEDURES TO AVOID SUCH FAILURES
ja: これらの違反を回避するためのポリシーと手続き

source: Mechanisms for handling non-standard licenses.
ja: 非標準ライセンスを取り扱うためのメカニズム

source: The team responsible for coordinating compliance activities has visibility into product development and product release plans and activities, and is able to interface effectively with product teams.
ja: コンプライアンス作業を調整する責任を負うチームが、製品開発や製品リリースの計画や作業を知ることができ、製品担当チームと効果的に連絡を取り合えること。

source: Figure 3 illustrates an example end-to-end compliance process that includes the various steps a software component goes through before the OSRB approves its acceptance in the build system and integration with the software product.
ja: 図 3 は詳細なコンプライアンス プロセスの例です。OSRB がビルド システムへの受け入れとソフトウェア製品との統合を承認するまでに、ソフトウェア コンポーネントが通過する各種手続きを示しています。

source: Frequently Performed / Occasionally Performed / Rarely Performed
ja: 頻繁に実行されている/時々実行されている/あまり実行されていない

source: Click here if you are an open source developer and need to contact a compliance officer.
ja: コンプライアンス オフィサーに連絡をとりたいオープン ソース開発者の方は、こちらから申し込んでください。

source: Stay tuned.
ja: しばらくお待ちください。

source: Every Friday, a preview release is built and delivered to the QA team to test major changes into the trunk and to provide a preview the weekly release.
ja: QA チームがメジャー チェンジをテストしてウィークリー リリースをプレビューできるように、毎週金曜日にプレビュー リリースがビルドされ、QA チームに配布されます。

source: Where the checklist highlights the need for additional work, organizations will benefit from training, benchmarking, and communicating about approaches to specific practices.
ja: チェックリストから追加作業の必要性が明らかになった場合は、特定の事例へのアプローチ方法について、トレーニング、ベンチマーキング、あるいはコミュニケーションなどを試みることで効果が得られるでしょう。

source: Supply chain personnel (including business development managers) are usually involved in moving software from the suppliers to your company.
ja: 通常は、サプライ チェーン担当者 (ビジネス開発マネージャーなど) が、サプライヤーから企業へのソフトウェア移動に関わります。

source: As a result, they continue to be unaware of the company's policies and procedures with respect to FOSS and compliance.
ja: その結果、彼らは FOSS やコンプライアンスに関する企業のポリシーや手続きを認識しなくなる。

source: In that
ja: そのような

source: Discovery & Disclosure
ja: 検出と開示◆◆

source: - Drives the compliance due diligence end-to-end process and acts as the compliance program manager ensuring all compliance related tasks are resolved and there are no compliance issues blocking product ship
ja: コンプライアンス精査の徹底を推進し、コンプライアンス プログラム マネージャーとして、すべてのコンプライアンス関連の問題解決を確認し、製品出荷を阻むコンプライアンス問題がないことを保証する

source: There are many power strategies that embedded Linux systems employ.
ja: 組込み Linux システムは、さまざまな電力戦略を使用しています。
